diplom-src/src/Documents/ВКМ_ПриемСотрудниковИУстановкаОплат/ВКМ_ПриемСотрудниковИУстановкаОплат.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ВКМ_ПриемСотрудниковИУстановкаОплат</name>
  <registerRecords>InformationRegister.ВКМ_ПринятыеУволенныеСотрудники</registerRecords>
  <registerRecords>InformationRegister.ВКМ_УсловияОплатыСотрудников</registerRecords>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Сотрудники</name>
    <attributes>
      <name>Сотрудник</name>
      <type>
        <types>CatalogRef.ВКМ_ФизическиеЛица</types>
      </type>
    </attributes>
    <attributes>
      <name>Оклад</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ПроцентОтРабот</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>2</precision>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

diplom-src/src/InformationRegisters/ВКМ_ПринятыеУволенныеСотрудники/ВКМ_ПринятыеУволенныеСотрудники.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ВКМ_ПринятыеУволенныеСотрудники</name>
  <informationRegisterPeriodicity>RecorderPosition</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>ПринятУволен</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <dimensions>
    <name>Сотрудник</name>
    <type>
      <types>CatalogRef.ВКМ_ФизическиеЛица</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

diplom-src/src/InformationRegisters/ВКМ_УсловияОплатыСотрудников/ВКМ_УсловияОплатыСотрудников.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ВКМ_УсловияОплатыСотрудников</name>
  <informationRegisterPeriodicity>Month</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>Оклад</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ПроцентОтРабот</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>2</precision>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Сотрудник</name>
    <type>
      <types>CatalogRef.ВКМ_ФизическиеЛица</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

diplom-src/src/Documents/ВКМ_ПриемСотрудниковИУстановкаОплат/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	
	Ответственный = Пользователи.ТекущийПользователь();
	
КонецПроцедуры


Процедура ОбработкаПроведения(Отказ,Режим)
	
	Движения.ВКМ_ПринятыеУволенныеСотрудники.Записывать = Истина;
	Движения.ВКМ_УсловияОплатыСотрудников.Записывать = Истина;

	
	Для Каждого СтрокаСотрудники Из Сотрудники Цикл
		Специалист = ВКМ_РасчетыИНачисления.ПроверитьДолжностьСотрудника(СтрокаСотрудники.Сотрудник);
	
		СтатусСотрудника = ВКМ_РасчетыИНачисления.ПроверкаСтатусаСотрудника(СтрокаСотрудники.Сотрудник, Дата);
		Если Не СтатусСотрудника Тогда
			Движение = Движения.ВКМ_ПринятыеУволенныеСотрудники.Добавить();
			Движение.Сотрудник = СтрокаСотрудники.Сотрудник;
			Движение.ПринятУволен = Истина;
			Движение.Период = Дата;
			Движение.Регистратор = Ссылка;
			
		КонецЕсли;
				
		Движение = Движения.ВКМ_УсловияОплатыСотрудников.Добавить();
		Движение.Сотрудник = СтрокаСотрудники.Сотрудник;
		Движение.Оклад = СтрокаСотрудники.Оклад;
		Движение.Период = Дата;
		Движение.Регистратор = Ссылка;
		Если Специалист Тогда	
		Движение.ПроцентОтРабот = СтрокаСотрудники.ПроцентОтРабот;
		КонецЕсли;
		
	КонецЦикла;

	
КонецПроцедуры

#КонецОбласти



#КонецЕсли
